espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_msc.h
/* Bit fields for MSC PAGELOCK6 */
#define _MSC_PAGELOCK6_RESETVALUE                 0x00000000UL                          /**< Default value for MSC_PAGELOCK6             */
#define _MSC_PAGELOCK6_MASK                       0xFFFFFFFFUL                          /**< Mask for MSC_PAGELOCK6                      */
#define _MSC_PAGELOCK6_LOCKBIT_SHIFT              0                                     /**< Shift value for MSC_LOCKBIT                 */
#define _MSC_PAGELOCK6_LOCKBIT_MASK               0xFFFFFFFFUL                          /**< Bit mask for MSC_LOCKBIT                    */
#define _MSC_PAGELOCK6_LOCKBIT_DEFAULT            0x00000000UL                          /**< Mode DEFAULT for MSC_PAGELOCK6              */
#define MSC_PAGELOCK6_LOCKBIT_DEFAULT             (_MSC_PAGELOCK6_LOCKBIT_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_PAGELOCK6      */

/* Bit fields for MSC PAGELOCK7 */
#define _MSC_PAGELOCK7_RESETVALUE                 0x00000000UL                          /**< Default value for MSC_PAGELOCK7             */
#define _MSC_PAGELOCK7_MASK                       0xFFFFFFFFUL                          /**< Mask for MSC_PAGELOCK7                      */
#define _MSC_PAGELOCK7_LOCKBIT_SHIFT              0                                     /**< Shift value for MSC_LOCKBIT                 */
#define _MSC_PAGELOCK7_LOCKBIT_MASK               0xFFFFFFFFUL                          /**< Bit mask for MSC_LOCKBIT                    */
#define _MSC_PAGELOCK7_LOCKBIT_DEFAULT            0x00000000UL                          /**< Mode DEFAULT for MSC_PAGELOCK7              */
#define MSC_PAGELOCK7_LOCKBIT_DEFAULT             (_MSC_PAGELOCK7_LOCKBIT_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_PAGELOCK7      */

/** @} End of group EFR32FG25_MSC_BitFields */
/** @} End of group EFR32FG25_MSC */
/** @} End of group Parts */

#endif /* EFR32FG25_MSC_H */
